Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/gfx2d.h
/**
 * \brief Component description for GFX2D
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_GFX2D_COMPONENT_H_
#define _SAM9X_GFX2D_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR GFX2D                                        */
/* ************************************************************************** */

/* -------- GFX2D_PA : (GFX2D Offset: 0x00) (R/W 32) Surface Physical Address Register -------- */
#define GFX2D_PA_PA_Pos                       _U_(0)                                               /**< (GFX2D_PA) Surface Physical Start Address Position */
#define GFX2D_PA_PA_Msk                       (_U_(0xFFFFFFFF) << GFX2D_PA_PA_Pos)                 /**< (GFX2D_PA) Surface Physical Start Address Mask */
#define GFX2D_PA_PA(value)                    (GFX2D_PA_PA_Msk & ((value) << GFX2D_PA_PA_Pos))    
#define GFX2D_PA_Msk                          _U_(0xFFFFFFFF)                                      /**< (GFX2D_PA) Register Mask  */


/* -------- GFX2D_PITCH : (GFX2D Offset: 0x04) (R/W 32) Surface Pitch Register -------- */
#define GFX2D_PITCH_PITCH_Pos                 _U_(0)                                               /**< (GFX2D_PITCH) Surface Pitch Position */
#define GFX2D_PITCH_PITCH_Msk                 (_U_(0xFFFF) << GFX2D_PITCH_PITCH_Pos)               /**< (GFX2D_PITCH) Surface Pitch Mask */
#define GFX2D_PITCH_PITCH(value)              (GFX2D_PITCH_PITCH_Msk & ((value) << GFX2D_PITCH_PITCH_Pos))
#define GFX2D_PITCH_Msk                       _U_(0x0000FFFF)                                      /**< (GFX2D_PITCH) Register Mask  */


/* -------- GFX2D_CFG : (GFX2D Offset: 0x08) (R/W 32) Surface Configuration Register -------- */
#define GFX2D_CFG_PF_Pos                      _U_(0)                                               /**< (GFX2D_CFG) Pixel Format Position */
#define GFX2D_CFG_PF_Msk                      (_U_(0xF) << GFX2D_CFG_PF_Pos)                       /**< (GFX2D_CFG) Pixel Format Mask */
#define GFX2D_CFG_PF(value)                   (GFX2D_CFG_PF_Msk & ((value) << GFX2D_CFG_PF_Pos))  
#define   GFX2D_CFG_PF_A4IDX4_Val             _U_(0x0)                                             /**< (GFX2D_CFG) 4-bit indexed color, with 4-bit alpha value  */
#define   GFX2D_CFG_PF_A8_Val                 _U_(0x1)                                             /**< (GFX2D_CFG) 8 bits per pixel alpha, with user-defined constant color  */
#define   GFX2D_CFG_PF_IDX8_Val               _U_(0x2)                                             /**< (GFX2D_CFG) 8 bits indexed color, uses the Color Look-Up Table to expand to true color  */
#define   GFX2D_CFG_PF_A8IDX8_Val             _U_(0x3)                                             /**< (GFX2D_CFG) 8-bit indexed color, with 8-bit alpha value  */
#define   GFX2D_CFG_PF_RGB12_Val              _U_(0x4)                                             /**< (GFX2D_CFG) 12 bits per pixel, 4 bits per color channel  */
#define   GFX2D_CFG_PF_ARGB16_Val             _U_(0x5)                                             /**< (GFX2D_CFG) 16 bits per pixel with 4-bit width alpha value, and 4 bits per color channel  */
#define   GFX2D_CFG_PF_RGB15_Val              _U_(0x6)                                             /**< (GFX2D_CFG) 15 bits per pixel, 5 bits per color channel  */
#define   GFX2D_CFG_PF_TRGB16_Val             _U_(0x7)                                             /**< (GFX2D_CFG) 16 bits per pixel, 5 bits for the red and blue channels and 6 bits for the green channel  */
#define   GFX2D_CFG_PF_RGBT16_Val             _U_(0x8)                                             /**< (GFX2D_CFG) 16 bits per pixel, with 1 bit for transparency and 5 bits for color channels  */
#define   GFX2D_CFG_PF_RGB16_Val              _U_(0x9)                                             /**< (GFX2D_CFG) 16 bits per pixel, 5 bits for the red and blue channels and 6 bits for the green channel  */
#define   GFX2D_CFG_PF_RGB24_Val              _U_(0xA)                                             /**< (GFX2D_CFG) 24 bits per pixel, 8 bits for alpha and color channels  */
#define   GFX2D_CFG_PF_ARGB32_Val             _U_(0xB)                                             /**< (GFX2D_CFG) 32 bits per pixel, 8 bits for alpha and color channels  */
#define   GFX2D_CFG_PF_RGBA32_Val             _U_(0xC)                                             /**< (GFX2D_CFG) 32 bits per pixel, 8 bits for alpha and color channels  */
#define GFX2D_CFG_PF_A4IDX4                   (GFX2D_CFG_PF_A4IDX4_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 4-bit indexed color, with 4-bit alpha value Position  */
#define GFX2D_CFG_PF_A8                       (GFX2D_CFG_PF_A8_Val << GFX2D_CFG_PF_Pos)            /**< (GFX2D_CFG) 8 bits per pixel alpha, with user-defined constant color Position  */
#define GFX2D_CFG_PF_IDX8                     (GFX2D_CFG_PF_IDX8_Val << GFX2D_CFG_PF_Pos)          /**< (GFX2D_CFG) 8 bits indexed color, uses the Color Look-Up Table to expand to true color Position  */
#define GFX2D_CFG_PF_A8IDX8                   (GFX2D_CFG_PF_A8IDX8_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 8-bit indexed color, with 8-bit alpha value Position  */
#define GFX2D_CFG_PF_RGB12                    (GFX2D_CFG_PF_RGB12_Val << GFX2D_CFG_PF_Pos)         /**< (GFX2D_CFG) 12 bits per pixel, 4 bits per color channel Position  */
#define GFX2D_CFG_PF_ARGB16                   (GFX2D_CFG_PF_ARGB16_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 16 bits per pixel with 4-bit width alpha value, and 4 bits per color channel Position  */
#define GFX2D_CFG_PF_RGB15                    (GFX2D_CFG_PF_RGB15_Val << GFX2D_CFG_PF_Pos)         /**< (GFX2D_CFG) 15 bits per pixel, 5 bits per color channel Position  */
#define GFX2D_CFG_PF_TRGB16                   (GFX2D_CFG_PF_TRGB16_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 16 bits per pixel, 5 bits for the red and blue channels and 6 bits for the green channel Position  */
#define GFX2D_CFG_PF_RGBT16                   (GFX2D_CFG_PF_RGBT16_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 16 bits per pixel, with 1 bit for transparency and 5 bits for color channels Position  */
#define GFX2D_CFG_PF_RGB16                    (GFX2D_CFG_PF_RGB16_Val << GFX2D_CFG_PF_Pos)         /**< (GFX2D_CFG) 16 bits per pixel, 5 bits for the red and blue channels and 6 bits for the green channel Position  */
#define GFX2D_CFG_PF_RGB24                    (GFX2D_CFG_PF_RGB24_Val << GFX2D_CFG_PF_Pos)         /**< (GFX2D_CFG) 24 bits per pixel, 8 bits for alpha and color channels Position  */
#define GFX2D_CFG_PF_ARGB32                   (GFX2D_CFG_PF_ARGB32_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 32 bits per pixel, 8 bits for alpha and color channels Position  */
#define GFX2D_CFG_PF_RGBA32                   (GFX2D_CFG_PF_RGBA32_Val << GFX2D_CFG_PF_Pos)        /**< (GFX2D_CFG) 32 bits per pixel, 8 bits for alpha and color channels Position  */
#define GFX2D_CFG_IDXCX_Pos                   _U_(4)                                               /**< (GFX2D_CFG) Color Look-Up Table Selection Position */
#define GFX2D_CFG_IDXCX_Msk                   (_U_(0x1) << GFX2D_CFG_IDXCX_Pos)                    /**< (GFX2D_CFG) Color Look-Up Table Selection Mask */
#define GFX2D_CFG_IDXCX(value)                (GFX2D_CFG_IDXCX_Msk & ((value) << GFX2D_CFG_IDXCX_Pos))
#define GFX2D_CFG_Msk                         _U_(0x0000001F)                                      /**< (GFX2D_CFG) Register Mask  */


/* -------- GFX2D_PC : (GFX2D Offset: 0x00) (R/W 32) Performance Configuration 0 Register -------- */
#define GFX2D_PC_SEL_Pos                      _U_(0)                                               /**< (GFX2D_PC) Performance Metrics Selection Position */
#define GFX2D_PC_SEL_Msk                      (_U_(0x3) << GFX2D_PC_SEL_Pos)                       /**< (GFX2D_PC) Performance Metrics Selection Mask */
#define GFX2D_PC_SEL(value)                   (GFX2D_PC_SEL_Msk & ((value) << GFX2D_PC_SEL_Pos))  
#define   GFX2D_PC_SEL_DISABLED_Val           _U_(0x0)                                             /**< (GFX2D_PC) The performance counter is disabled and reset.  */
#define   GFX2D_PC_SEL_READ_Val               _U_(0x1)                                             /**< (GFX2D_PC) The performance counter is incremented when a Read access is performed.  */
#define   GFX2D_PC_SEL_WRITE_Val              _U_(0x2)                                             /**< (GFX2D_PC) The performance counter is incremented when a Write access is performed.  */
#define   GFX2D_PC_SEL_CYCLE_Val              _U_(0x3)                                             /**< (GFX2D_PC) Number of clock cycles  */
#define GFX2D_PC_SEL_DISABLED                 (GFX2D_PC_SEL_DISABLED_Val << GFX2D_PC_SEL_Pos)      /**< (GFX2D_PC) The performance counter is disabled and reset. Position  */
#define GFX2D_PC_SEL_READ                     (GFX2D_PC_SEL_READ_Val << GFX2D_PC_SEL_Pos)          /**< (GFX2D_PC) The performance counter is incremented when a Read access is performed. Position  */
#define GFX2D_PC_SEL_WRITE                    (GFX2D_PC_SEL_WRITE_Val << GFX2D_PC_SEL_Pos)         /**< (GFX2D_PC) The performance counter is incremented when a Write access is performed. Position  */
#define GFX2D_PC_SEL_CYCLE                    (GFX2D_PC_SEL_CYCLE_Val << GFX2D_PC_SEL_Pos)         /**< (GFX2D_PC) Number of clock cycles Position  */
#define GFX2D_PC_FILT_Pos                     _U_(4)                                               /**< (GFX2D_PC) Filter Configuration Position */
#define GFX2D_PC_FILT_Msk                     (_U_(0x7) << GFX2D_PC_FILT_Pos)                      /**< (GFX2D_PC) Filter Configuration Mask */
#define GFX2D_PC_FILT(value)                  (GFX2D_PC_FILT_Msk & ((value) << GFX2D_PC_FILT_Pos))
#define   GFX2D_PC_FILT_DISABLED_Val          _U_(0x0)                                             /**< (GFX2D_PC) The filter is disabled.  */
#define   GFX2D_PC_FILT_QOS0_Val              _U_(0x1)                                             /**< (GFX2D_PC) Events are valid when input QoS is equal to 0.  */
#define   GFX2D_PC_FILT_QOS1_Val              _U_(0x2)                                             /**< (GFX2D_PC) Events are valid when input QoS is equal to 1.  */
#define   GFX2D_PC_FILT_QOS2_Val              _U_(0x3)                                             /**< (GFX2D_PC) Events are valid when input QoS is equal to 2.  */
#define   GFX2D_PC_FILT_QOS3_Val              _U_(0x4)                                             /**< (GFX2D_PC) Events are valid when input QoS is equal to 3.  */
#define GFX2D_PC_FILT_DISABLED                (GFX2D_PC_FILT_DISABLED_Val << GFX2D_PC_FILT_Pos)    /**< (GFX2D_PC) The filter is disabled. Position  */
#define GFX2D_PC_FILT_QOS0                    (GFX2D_PC_FILT_QOS0_Val << GFX2D_PC_FILT_Pos)        /**< (GFX2D_PC) Events are valid when input QoS is equal to 0. Position  */
#define GFX2D_PC_FILT_QOS1                    (GFX2D_PC_FILT_QOS1_Val << GFX2D_PC_FILT_Pos)        /**< (GFX2D_PC) Events are valid when input QoS is equal to 1. Position  */
#define GFX2D_PC_FILT_QOS2                    (GFX2D_PC_FILT_QOS2_Val << GFX2D_PC_FILT_Pos)        /**< (GFX2D_PC) Events are valid when input QoS is equal to 2. Position  */
#define GFX2D_PC_FILT_QOS3                    (GFX2D_PC_FILT_QOS3_Val << GFX2D_PC_FILT_Pos)        /**< (GFX2D_PC) Events are valid when input QoS is equal to 3. Position  */
#define GFX2D_PC_Msk                          _U_(0x00000073)                                      /**< (GFX2D_PC) Register Mask  */


