Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/gfx2d.h
/* -------- GFX2D_MC : (GFX2D Offset: 0x04) ( R/ 32) Metrics Counter 0 Register -------- */
#define GFX2D_MC_COUNTER_Pos                  _U_(0)                                               /**< (GFX2D_MC) Metrics Counter Position */
#define GFX2D_MC_COUNTER_Msk                  (_U_(0xFFFFFFFF) << GFX2D_MC_COUNTER_Pos)            /**< (GFX2D_MC) Metrics Counter Mask */
#define GFX2D_MC_COUNTER(value)               (GFX2D_MC_COUNTER_Msk & ((value) << GFX2D_MC_COUNTER_Pos))
#define GFX2D_MC_Msk                          _U_(0xFFFFFFFF)                                      /**< (GFX2D_MC) Register Mask  */


/* -------- GFX2D_GC : (GFX2D Offset: 0x00) (R/W 32) Global Configuration Register -------- */
#define GFX2D_GC_CGDISCORE_Pos                _U_(0)                                               /**< (GFX2D_GC) Clock Gating Disable Core Position */
#define GFX2D_GC_CGDISCORE_Msk                (_U_(0x1) << GFX2D_GC_CGDISCORE_Pos)                 /**< (GFX2D_GC) Clock Gating Disable Core Mask */
#define GFX2D_GC_CGDISCORE(value)             (GFX2D_GC_CGDISCORE_Msk & ((value) << GFX2D_GC_CGDISCORE_Pos))
#define GFX2D_GC_CGDISAXI_Pos                 _U_(1)                                               /**< (GFX2D_GC) Clock Gating Disable AXI Position */
#define GFX2D_GC_CGDISAXI_Msk                 (_U_(0x1) << GFX2D_GC_CGDISAXI_Pos)                  /**< (GFX2D_GC) Clock Gating Disable AXI Mask */
#define GFX2D_GC_CGDISAXI(value)              (GFX2D_GC_CGDISAXI_Msk & ((value) << GFX2D_GC_CGDISAXI_Pos))
#define GFX2D_GC_CGDISFIFO_Pos                _U_(2)                                               /**< (GFX2D_GC) Clock Gating Disable FIFO Position */
#define GFX2D_GC_CGDISFIFO_Msk                (_U_(0x1) << GFX2D_GC_CGDISFIFO_Pos)                 /**< (GFX2D_GC) Clock Gating Disable FIFO Mask */
#define GFX2D_GC_CGDISFIFO(value)             (GFX2D_GC_CGDISFIFO_Msk & ((value) << GFX2D_GC_CGDISFIFO_Pos))
#define GFX2D_GC_REGEN_Pos                    _U_(4)                                               /**< (GFX2D_GC) Outstanding Regulation Enable Position */
#define GFX2D_GC_REGEN_Msk                    (_U_(0x1) << GFX2D_GC_REGEN_Pos)                     /**< (GFX2D_GC) Outstanding Regulation Enable Mask */
#define GFX2D_GC_REGEN(value)                 (GFX2D_GC_REGEN_Msk & ((value) << GFX2D_GC_REGEN_Pos))
#define GFX2D_GC_MTY_Pos                      _U_(6)                                               /**< (GFX2D_GC) Memory Tile Access Position */
#define GFX2D_GC_MTY_Msk                      (_U_(0x1) << GFX2D_GC_MTY_Pos)                       /**< (GFX2D_GC) Memory Tile Access Mask */
#define GFX2D_GC_MTY(value)                   (GFX2D_GC_MTY_Msk & ((value) << GFX2D_GC_MTY_Pos))  
#define GFX2D_GC_REGQOS1_Pos                  _U_(8)                                               /**< (GFX2D_GC) Regulation for QoS Level 1 Position */
#define GFX2D_GC_REGQOS1_Msk                  (_U_(0xF) << GFX2D_GC_REGQOS1_Pos)                   /**< (GFX2D_GC) Regulation for QoS Level 1 Mask */
#define GFX2D_GC_REGQOS1(value)               (GFX2D_GC_REGQOS1_Msk & ((value) << GFX2D_GC_REGQOS1_Pos))
#define GFX2D_GC_REGQOS2_Pos                  _U_(12)                                              /**< (GFX2D_GC) Regulation for QoS Level 2 Position */
#define GFX2D_GC_REGQOS2_Msk                  (_U_(0xF) << GFX2D_GC_REGQOS2_Pos)                   /**< (GFX2D_GC) Regulation for QoS Level 2 Mask */
#define GFX2D_GC_REGQOS2(value)               (GFX2D_GC_REGQOS2_Msk & ((value) << GFX2D_GC_REGQOS2_Pos))
#define GFX2D_GC_REGQOS3_Pos                  _U_(16)                                              /**< (GFX2D_GC) Regulation for QoS Level 3 Position */
#define GFX2D_GC_REGQOS3_Msk                  (_U_(0xF) << GFX2D_GC_REGQOS3_Pos)                   /**< (GFX2D_GC) Regulation for QoS Level 3 Mask */
#define GFX2D_GC_REGQOS3(value)               (GFX2D_GC_REGQOS3_Msk & ((value) << GFX2D_GC_REGQOS3_Pos))
#define GFX2D_GC_Msk                          _U_(0x000FFF57)                                      /**< (GFX2D_GC) Register Mask  */


/* -------- GFX2D_GE : (GFX2D Offset: 0x04) ( /W 32) Global Enable Register -------- */
#define GFX2D_GE_ENABLE_Pos                   _U_(0)                                               /**< (GFX2D_GE) GFX2D Enable Position */
#define GFX2D_GE_ENABLE_Msk                   (_U_(0x1) << GFX2D_GE_ENABLE_Pos)                    /**< (GFX2D_GE) GFX2D Enable Mask */
#define GFX2D_GE_ENABLE(value)                (GFX2D_GE_ENABLE_Msk & ((value) << GFX2D_GE_ENABLE_Pos))
#define GFX2D_GE_Msk                          _U_(0x00000001)                                      /**< (GFX2D_GE) Register Mask  */


/* -------- GFX2D_GD : (GFX2D Offset: 0x08) ( /W 32) Global Disable Register -------- */
#define GFX2D_GD_DISABLE_Pos                  _U_(0)                                               /**< (GFX2D_GD) GFX2D Disable Bit Position */
#define GFX2D_GD_DISABLE_Msk                  (_U_(0x1) << GFX2D_GD_DISABLE_Pos)                   /**< (GFX2D_GD) GFX2D Disable Bit Mask */
#define GFX2D_GD_DISABLE(value)               (GFX2D_GD_DISABLE_Msk & ((value) << GFX2D_GD_DISABLE_Pos))
#define GFX2D_GD_WFERES_Pos                   _U_(8)                                               /**< (GFX2D_GD) WFE Software Resume bit Position */
#define GFX2D_GD_WFERES_Msk                   (_U_(0x1) << GFX2D_GD_WFERES_Pos)                    /**< (GFX2D_GD) WFE Software Resume bit Mask */
#define GFX2D_GD_WFERES(value)                (GFX2D_GD_WFERES_Msk & ((value) << GFX2D_GD_WFERES_Pos))
#define GFX2D_GD_Msk                          _U_(0x00000101)                                      /**< (GFX2D_GD) Register Mask  */


/* -------- GFX2D_GS : (GFX2D Offset: 0x0C) ( R/ 32) Global Status Register -------- */
#define GFX2D_GS_STATUS_Pos                   _U_(0)                                               /**< (GFX2D_GS) GFX2D Status Bit Position */
#define GFX2D_GS_STATUS_Msk                   (_U_(0x1) << GFX2D_GS_STATUS_Pos)                    /**< (GFX2D_GS) GFX2D Status Bit Mask */
#define GFX2D_GS_STATUS(value)                (GFX2D_GS_STATUS_Msk & ((value) << GFX2D_GS_STATUS_Pos))
#define GFX2D_GS_BUSY_Pos                     _U_(4)                                               /**< (GFX2D_GS) GFX2D Busy Bit Position */
#define GFX2D_GS_BUSY_Msk                     (_U_(0x1) << GFX2D_GS_BUSY_Pos)                      /**< (GFX2D_GS) GFX2D Busy Bit Mask */
#define GFX2D_GS_BUSY(value)                  (GFX2D_GS_BUSY_Msk & ((value) << GFX2D_GS_BUSY_Pos))
#define GFX2D_GS_WFEIP_Pos                    _U_(8)                                               /**< (GFX2D_GS) Wait For Event Status bit Position */
#define GFX2D_GS_WFEIP_Msk                    (_U_(0x1) << GFX2D_GS_WFEIP_Pos)                     /**< (GFX2D_GS) Wait For Event Status bit Mask */
#define GFX2D_GS_WFEIP(value)                 (GFX2D_GS_WFEIP_Msk & ((value) << GFX2D_GS_WFEIP_Pos))
#define GFX2D_GS_Msk                          _U_(0x00000111)                                      /**< (GFX2D_GS) Register Mask  */


/* -------- GFX2D_IE : (GFX2D Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define GFX2D_IE_RBEMPTY_Pos                  _U_(0)                                               /**< (GFX2D_IE) Ring Buffer Empty Interrupt Enable Bit Position */
#define GFX2D_IE_RBEMPTY_Msk                  (_U_(0x1) << GFX2D_IE_RBEMPTY_Pos)                   /**< (GFX2D_IE) Ring Buffer Empty Interrupt Enable Bit Mask */
#define GFX2D_IE_RBEMPTY(value)               (GFX2D_IE_RBEMPTY_Msk & ((value) << GFX2D_IE_RBEMPTY_Pos))
#define GFX2D_IE_EXEND_Pos                    _U_(1)                                               /**< (GFX2D_IE) End of Execution Interrupt Enable Bit Position */
#define GFX2D_IE_EXEND_Msk                    (_U_(0x1) << GFX2D_IE_EXEND_Pos)                     /**< (GFX2D_IE) End of Execution Interrupt Enable Bit Mask */
#define GFX2D_IE_EXEND(value)                 (GFX2D_IE_EXEND_Msk & ((value) << GFX2D_IE_EXEND_Pos))
#define GFX2D_IE_RERR_Pos                     _U_(2)                                               /**< (GFX2D_IE) Read Data Bus Error Interrupt Enable Bit Position */
#define GFX2D_IE_RERR_Msk                     (_U_(0x1) << GFX2D_IE_RERR_Pos)                      /**< (GFX2D_IE) Read Data Bus Error Interrupt Enable Bit Mask */
#define GFX2D_IE_RERR(value)                  (GFX2D_IE_RERR_Msk & ((value) << GFX2D_IE_RERR_Pos))
#define GFX2D_IE_BERR_Pos                     _U_(3)                                               /**< (GFX2D_IE) Write Data Bus Error Interrupt Enable Bit Position */
#define GFX2D_IE_BERR_Msk                     (_U_(0x1) << GFX2D_IE_BERR_Pos)                      /**< (GFX2D_IE) Write Data Bus Error Interrupt Enable Bit Mask */
#define GFX2D_IE_BERR(value)                  (GFX2D_IE_BERR_Msk & ((value) << GFX2D_IE_BERR_Pos))
#define GFX2D_IE_IERR_Pos                     _U_(4)                                               /**< (GFX2D_IE) Illegal Instruction Interrupt Enable Bit Position */
#define GFX2D_IE_IERR_Msk                     (_U_(0x1) << GFX2D_IE_IERR_Pos)                      /**< (GFX2D_IE) Illegal Instruction Interrupt Enable Bit Mask */
#define GFX2D_IE_IERR(value)                  (GFX2D_IE_IERR_Msk & ((value) << GFX2D_IE_IERR_Pos))
#define GFX2D_IE_Msk                          _U_(0x0000001F)                                      /**< (GFX2D_IE) Register Mask  */


/* -------- GFX2D_ID : (GFX2D Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define GFX2D_ID_RBEMPTY_Pos                  _U_(0)                                               /**< (GFX2D_ID) Ring Buffer Empty Interrupt Disable Bit Position */
#define GFX2D_ID_RBEMPTY_Msk                  (_U_(0x1) << GFX2D_ID_RBEMPTY_Pos)                   /**< (GFX2D_ID) Ring Buffer Empty Interrupt Disable Bit Mask */
#define GFX2D_ID_RBEMPTY(value)               (GFX2D_ID_RBEMPTY_Msk & ((value) << GFX2D_ID_RBEMPTY_Pos))
#define GFX2D_ID_EXEND_Pos                    _U_(1)                                               /**< (GFX2D_ID) End of Execution Interrupt Disable Bit Position */
#define GFX2D_ID_EXEND_Msk                    (_U_(0x1) << GFX2D_ID_EXEND_Pos)                     /**< (GFX2D_ID) End of Execution Interrupt Disable Bit Mask */
#define GFX2D_ID_EXEND(value)                 (GFX2D_ID_EXEND_Msk & ((value) << GFX2D_ID_EXEND_Pos))
#define GFX2D_ID_RERR_Pos                     _U_(2)                                               /**< (GFX2D_ID) Read Access Error Interrupt Disable Bit Position */
#define GFX2D_ID_RERR_Msk                     (_U_(0x1) << GFX2D_ID_RERR_Pos)                      /**< (GFX2D_ID) Read Access Error Interrupt Disable Bit Mask */
#define GFX2D_ID_RERR(value)                  (GFX2D_ID_RERR_Msk & ((value) << GFX2D_ID_RERR_Pos))
#define GFX2D_ID_BERR_Pos                     _U_(3)                                               /**< (GFX2D_ID) Write Access Error Interrupt Disable bit Position */
#define GFX2D_ID_BERR_Msk                     (_U_(0x1) << GFX2D_ID_BERR_Pos)                      /**< (GFX2D_ID) Write Access Error Interrupt Disable bit Mask */
#define GFX2D_ID_BERR(value)                  (GFX2D_ID_BERR_Msk & ((value) << GFX2D_ID_BERR_Pos))
#define GFX2D_ID_IERR_Pos                     _U_(4)                                               /**< (GFX2D_ID) Illegal Instruction Interrupt Disable bit Position */
#define GFX2D_ID_IERR_Msk                     (_U_(0x1) << GFX2D_ID_IERR_Pos)                      /**< (GFX2D_ID) Illegal Instruction Interrupt Disable bit Mask */
#define GFX2D_ID_IERR(value)                  (GFX2D_ID_IERR_Msk & ((value) << GFX2D_ID_IERR_Pos))
#define GFX2D_ID_Msk                          _U_(0x0000001F)                                      /**< (GFX2D_ID) Register Mask  */


/* -------- GFX2D_IM : (GFX2D Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define GFX2D_IM_RBEMPTY_Pos                  _U_(0)                                               /**< (GFX2D_IM) Ring Buffer Empty Interrupt Mask Bit Position */
#define GFX2D_IM_RBEMPTY_Msk                  (_U_(0x1) << GFX2D_IM_RBEMPTY_Pos)                   /**< (GFX2D_IM) Ring Buffer Empty Interrupt Mask Bit Mask */
#define GFX2D_IM_RBEMPTY(value)               (GFX2D_IM_RBEMPTY_Msk & ((value) << GFX2D_IM_RBEMPTY_Pos))
#define GFX2D_IM_EXEND_Pos                    _U_(1)                                               /**< (GFX2D_IM) Execution Ended Empty Interrupt Mask Bit Position */
#define GFX2D_IM_EXEND_Msk                    (_U_(0x1) << GFX2D_IM_EXEND_Pos)                     /**< (GFX2D_IM) Execution Ended Empty Interrupt Mask Bit Mask */
#define GFX2D_IM_EXEND(value)                 (GFX2D_IM_EXEND_Msk & ((value) << GFX2D_IM_EXEND_Pos))
#define GFX2D_IM_RERR_Pos                     _U_(2)                                               /**< (GFX2D_IM) Read Error Interrupt Mask Bit Position */
#define GFX2D_IM_RERR_Msk                     (_U_(0x1) << GFX2D_IM_RERR_Pos)                      /**< (GFX2D_IM) Read Error Interrupt Mask Bit Mask */
#define GFX2D_IM_RERR(value)                  (GFX2D_IM_RERR_Msk & ((value) << GFX2D_IM_RERR_Pos))
#define GFX2D_IM_BERR_Pos                     _U_(3)                                               /**< (GFX2D_IM) Write Error Interrupt Mask Bit Position */
#define GFX2D_IM_BERR_Msk                     (_U_(0x1) << GFX2D_IM_BERR_Pos)                      /**< (GFX2D_IM) Write Error Interrupt Mask Bit Mask */
#define GFX2D_IM_BERR(value)                  (GFX2D_IM_BERR_Msk & ((value) << GFX2D_IM_BERR_Pos))
#define GFX2D_IM_IERR_Pos                     _U_(4)                                               /**< (GFX2D_IM) Illegal Instruction Interrupt Mask Bit Position */
#define GFX2D_IM_IERR_Msk                     (_U_(0x1) << GFX2D_IM_IERR_Pos)                      /**< (GFX2D_IM) Illegal Instruction Interrupt Mask Bit Mask */
#define GFX2D_IM_IERR(value)                  (GFX2D_IM_IERR_Msk & ((value) << GFX2D_IM_IERR_Pos))
#define GFX2D_IM_Msk                          _U_(0x0000001F)                                      /**< (GFX2D_IM) Register Mask  */


/* -------- GFX2D_IS : (GFX2D Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define GFX2D_IS_RBEMPTY_Pos                  _U_(0)                                               /**< (GFX2D_IS) Ring Buffer Empty Interrupt Status Bit Position */
#define GFX2D_IS_RBEMPTY_Msk                  (_U_(0x1) << GFX2D_IS_RBEMPTY_Pos)                   /**< (GFX2D_IS) Ring Buffer Empty Interrupt Status Bit Mask */
#define GFX2D_IS_RBEMPTY(value)               (GFX2D_IS_RBEMPTY_Msk & ((value) << GFX2D_IS_RBEMPTY_Pos))
#define GFX2D_IS_EXEND_Pos                    _U_(1)                                               /**< (GFX2D_IS) End of Execution Status Bit Position */
#define GFX2D_IS_EXEND_Msk                    (_U_(0x1) << GFX2D_IS_EXEND_Pos)                     /**< (GFX2D_IS) End of Execution Status Bit Mask */
#define GFX2D_IS_EXEND(value)                 (GFX2D_IS_EXEND_Msk & ((value) << GFX2D_IS_EXEND_Pos))
#define GFX2D_IS_RERR_Pos                     _U_(2)                                               /**< (GFX2D_IS) Read Error Interrupt Status Bit Position */
#define GFX2D_IS_RERR_Msk                     (_U_(0x1) << GFX2D_IS_RERR_Pos)                      /**< (GFX2D_IS) Read Error Interrupt Status Bit Mask */
#define GFX2D_IS_RERR(value)                  (GFX2D_IS_RERR_Msk & ((value) << GFX2D_IS_RERR_Pos))
#define GFX2D_IS_BERR_Pos                     _U_(3)                                               /**< (GFX2D_IS) Write Error Interrupt Status Bit Position */
#define GFX2D_IS_BERR_Msk                     (_U_(0x1) << GFX2D_IS_BERR_Pos)                      /**< (GFX2D_IS) Write Error Interrupt Status Bit Mask */
#define GFX2D_IS_BERR(value)                  (GFX2D_IS_BERR_Msk & ((value) << GFX2D_IS_BERR_Pos))
#define GFX2D_IS_IERR_Pos                     _U_(4)                                               /**< (GFX2D_IS) Illegal Instruction Interrupt Status Bit Position */
#define GFX2D_IS_IERR_Msk                     (_U_(0x1) << GFX2D_IS_IERR_Pos)                      /**< (GFX2D_IS) Illegal Instruction Interrupt Status Bit Mask */
#define GFX2D_IS_IERR(value)                  (GFX2D_IS_IERR_Msk & ((value) << GFX2D_IS_IERR_Pos))
#define GFX2D_IS_Msk                          _U_(0x0000001F)                                      /**< (GFX2D_IS) Register Mask  */


