Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/gfx2d.h
/* -------- GFX2D_BASE : (GFX2D Offset: 0x30) (R/W 32) Ring Buffer Base Register -------- */
#define GFX2D_BASE_BASE_Pos                   _U_(8)                                               /**< (GFX2D_BASE) Ring Buffer Base Register Position */
#define GFX2D_BASE_BASE_Msk                   (_U_(0xFFFFFF) << GFX2D_BASE_BASE_Pos)               /**< (GFX2D_BASE) Ring Buffer Base Register Mask */
#define GFX2D_BASE_BASE(value)                (GFX2D_BASE_BASE_Msk & ((value) << GFX2D_BASE_BASE_Pos))
#define GFX2D_BASE_Msk                        _U_(0xFFFFFF00)                                      /**< (GFX2D_BASE) Register Mask  */


/* -------- GFX2D_LEN : (GFX2D Offset: 0x34) (R/W 32) Ring Buffer Length Register -------- */
#define GFX2D_LEN_LEN_Pos                     _U_(0)                                               /**< (GFX2D_LEN) Ring Buffer Length Multiplier Position */
#define GFX2D_LEN_LEN_Msk                     (_U_(0xF) << GFX2D_LEN_LEN_Pos)                      /**< (GFX2D_LEN) Ring Buffer Length Multiplier Mask */
#define GFX2D_LEN_LEN(value)                  (GFX2D_LEN_LEN_Msk & ((value) << GFX2D_LEN_LEN_Pos))
#define GFX2D_LEN_Msk                         _U_(0x0000000F)                                      /**< (GFX2D_LEN) Register Mask  */


/* -------- GFX2D_HEAD : (GFX2D Offset: 0x38) (R/W 32) Ring Buffer Head Register -------- */
#define GFX2D_HEAD_HEAD_Pos                   _U_(0)                                               /**< (GFX2D_HEAD) Ring Buffer Head Pointer Position */
#define GFX2D_HEAD_HEAD_Msk                   (_U_(0x3FF) << GFX2D_HEAD_HEAD_Pos)                  /**< (GFX2D_HEAD) Ring Buffer Head Pointer Mask */
#define GFX2D_HEAD_HEAD(value)                (GFX2D_HEAD_HEAD_Msk & ((value) << GFX2D_HEAD_HEAD_Pos))
#define GFX2D_HEAD_Msk                        _U_(0x000003FF)                                      /**< (GFX2D_HEAD) Register Mask  */


/* -------- GFX2D_TAIL : (GFX2D Offset: 0x3C) (R/W 32) Ring Buffer Tail Register -------- */
#define GFX2D_TAIL_TAIL_Pos                   _U_(0)                                               /**< (GFX2D_TAIL) Ring Buffer Tail Pointer Position */
#define GFX2D_TAIL_TAIL_Msk                   (_U_(0x3FF) << GFX2D_TAIL_TAIL_Pos)                  /**< (GFX2D_TAIL) Ring Buffer Tail Pointer Mask */
#define GFX2D_TAIL_TAIL(value)                (GFX2D_TAIL_TAIL_Msk & ((value) << GFX2D_TAIL_TAIL_Pos))
#define GFX2D_TAIL_Msk                        _U_(0x000003FF)                                      /**< (GFX2D_TAIL) Register Mask  */


/* -------- GFX2D_VERSION : (GFX2D Offset: 0xFC) ( R/ 32) Version Register -------- */
#define GFX2D_VERSION_VERSION_Pos             _U_(0)                                               /**< (GFX2D_VERSION) Version Position */
#define GFX2D_VERSION_VERSION_Msk             (_U_(0xFFF) << GFX2D_VERSION_VERSION_Pos)            /**< (GFX2D_VERSION) Version Mask */
#define GFX2D_VERSION_VERSION(value)          (GFX2D_VERSION_VERSION_Msk & ((value) << GFX2D_VERSION_VERSION_Pos))
#define GFX2D_VERSION_MFN_Pos                 _U_(16)                                              /**< (GFX2D_VERSION) Metal Fix Number Position */
#define GFX2D_VERSION_MFN_Msk                 (_U_(0x7) << GFX2D_VERSION_MFN_Pos)                  /**< (GFX2D_VERSION) Metal Fix Number Mask */
#define GFX2D_VERSION_MFN(value)              (GFX2D_VERSION_MFN_Msk & ((value) << GFX2D_VERSION_MFN_Pos))
#define GFX2D_VERSION_Msk                     _U_(0x00070FFF)                                      /**< (GFX2D_VERSION) Register Mask  */


/** \brief GFX2D register offsets definitions */
#define GFX2D_PA_REG_OFST              (0x00)              /**< (GFX2D_PA) Surface Physical Address Register Offset */
#define GFX2D_PITCH_REG_OFST           (0x04)              /**< (GFX2D_PITCH) Surface Pitch Register Offset */
#define GFX2D_CFG_REG_OFST             (0x08)              /**< (GFX2D_CFG) Surface Configuration Register Offset */
#define GFX2D_PC_REG_OFST              (0x00)              /**< (GFX2D_PC) Performance Configuration 0 Register Offset */
#define GFX2D_MC_REG_OFST              (0x04)              /**< (GFX2D_MC) Metrics Counter 0 Register Offset */
#define GFX2D_GC_REG_OFST              (0x00)              /**< (GFX2D_GC) Global Configuration Register Offset */
#define GFX2D_GE_REG_OFST              (0x04)              /**< (GFX2D_GE) Global Enable Register Offset */
#define GFX2D_GD_REG_OFST              (0x08)              /**< (GFX2D_GD) Global Disable Register Offset */
#define GFX2D_GS_REG_OFST              (0x0C)              /**< (GFX2D_GS) Global Status Register Offset */
#define GFX2D_IE_REG_OFST              (0x10)              /**< (GFX2D_IE) Interrupt Enable Register Offset */
#define GFX2D_ID_REG_OFST              (0x14)              /**< (GFX2D_ID) Interrupt Disable Register Offset */
#define GFX2D_IM_REG_OFST              (0x18)              /**< (GFX2D_IM) Interrupt Mask Register Offset */
#define GFX2D_IS_REG_OFST              (0x1C)              /**< (GFX2D_IS) Interrupt Status Register Offset */
#define GFX2D_BASE_REG_OFST            (0x30)              /**< (GFX2D_BASE) Ring Buffer Base Register Offset */
#define GFX2D_LEN_REG_OFST             (0x34)              /**< (GFX2D_LEN) Ring Buffer Length Register Offset */
#define GFX2D_HEAD_REG_OFST            (0x38)              /**< (GFX2D_HEAD) Ring Buffer Head Register Offset */
#define GFX2D_TAIL_REG_OFST            (0x3C)              /**< (GFX2D_TAIL) Ring Buffer Tail Register Offset */
#define GFX2D_VERSION_REG_OFST         (0xFC)              /**< (GFX2D_VERSION) Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GFX2D_CHID register API structure */
typedef struct
{
  __IO  uint32_t                       GFX2D_PA;           /**< Offset: 0x00 (R/W  32) Surface Physical Address Register */
  __IO  uint32_t                       GFX2D_PITCH;        /**< Offset: 0x04 (R/W  32) Surface Pitch Register */
  __IO  uint32_t                       GFX2D_CFG;          /**< Offset: 0x08 (R/W  32) Surface Configuration Register */
  __I   uint8_t                        Reserved1[0x04];
} gfx2d_chid_registers_t;

