Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/gfx2d.h
/** \brief GFX2D_SUB0 register API structure */
typedef struct
{
  __IO  uint32_t                       GFX2D_PC;           /**< Offset: 0x00 (R/W  32) Performance Configuration 0 Register */
  __I   uint32_t                       GFX2D_MC;           /**< Offset: 0x04 (R/   32) Metrics Counter 0 Register */
} gfx2d_sub0_registers_t;

#define GFX2D_SUB0_NUMBER _U_(2)

#define GFX2D_CHID_NUMBER _U_(4)

/** \brief GFX2D register API structure */
typedef struct
{
  __IO  uint32_t                       GFX2D_GC;           /**< Offset: 0x00 (R/W  32) Global Configuration Register */
  __O   uint32_t                       GFX2D_GE;           /**< Offset: 0x04 ( /W  32) Global Enable Register */
  __O   uint32_t                       GFX2D_GD;           /**< Offset: 0x08 ( /W  32) Global Disable Register */
  __I   uint32_t                       GFX2D_GS;           /**< Offset: 0x0C (R/   32) Global Status Register */
  __O   uint32_t                       GFX2D_IE;           /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       GFX2D_ID;           /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       GFX2D_IM;           /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       GFX2D_IS;           /**< Offset: 0x1C (R/   32) Interrupt Status Register */
        gfx2d_sub0_registers_t         GFX2D_SUB0[GFX2D_SUB0_NUMBER]; /**< Offset: 0x20  */
  __IO  uint32_t                       GFX2D_BASE;         /**< Offset: 0x30 (R/W  32) Ring Buffer Base Register */
  __IO  uint32_t                       GFX2D_LEN;          /**< Offset: 0x34 (R/W  32) Ring Buffer Length Register */
  __IO  uint32_t                       GFX2D_HEAD;         /**< Offset: 0x38 (R/W  32) Ring Buffer Head Register */
  __IO  uint32_t                       GFX2D_TAIL;         /**< Offset: 0x3C (R/W  32) Ring Buffer Tail Register */
        gfx2d_chid_registers_t         GFX2D_CHID[GFX2D_CHID_NUMBER]; /**< Offset: 0x40  */
  __I   uint8_t                        Reserved1[0x7C];
  __I   uint32_t                       GFX2D_VERSION;      /**< Offset: 0xFC (R/   32) Version Register */
} gfx2d_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_GFX2D_COMPONENT_H_ */
